# -------------------- 模块和包 --------------------
# 两者的关系:一个包当中可以有多个模块

# -------------------- 引用模块1 --------------------
# import demo_module
#
# # 这种方式每次都要写模块名诶...能更简单一些嘛?
# demo_module.print_msg()
# print(demo_module.name)

# -------------------- 引用模块2 --------------------
from demo_module import print_msg, name
# 如果要引入模块中的所有内容的话,可以这样
# from demo_module import *
#
# print_msg()
# print(name)
# p1 = Person("kino", 17)
# print(p1)


# -------------------- 引用包 --------------------
"""
如果说模块是将函数,全局变量等组合到一起供外界使用的话
那么包就是将多个模块组合到一起供外界使用
"""


