# -------------------------------- practice1 --------------------------------
# 在控制台上输入您的成绩分数
# 如果你考了90以上  成绩为优秀
# 如果你考了80以上  成绩为良好
# 如果你考了70以上  成绩为中等
# 如果你考了60以上  成绩为合格
# 如果你考了0以上   成绩为不合格
# 否则            你在逗我..

# score = int(input('请输入您的成绩'))

# if score >= 90:
#     print('优秀')
# elif score >= 80:
#     print('良好')
# elif score >= 70:
#     print('中等')
# elif score >= 60:
#     print('及格')
# elif score >= 0:
#     print('不及格')
# else:
#     print('别搞...')

# 案例中考察了三个知识点
# （1） 控制台输入
# （2） 强制类型转换
# （3） int和str是不能比较的

# -------------------------------- practice2 --------------------------------
# 寻找水仙花数。
# 水仙花数也被称为超完全数字不变数、自恋数、自幂数、阿姆斯特朗数，它是一个3位数，该数字每个位上数字的立方之和正好等于它本身
# 例如： 153=1^3+5^3+3^3 。

# for num in range(100, 1000):
#     low = num % 10
#     mid = num // 10 % 10
#     high = num // 100
#     if num == low ** 3 + mid ** 3 + high ** 3:
#         print(num)

# -------------------------------- practice3 --------------------------------
# 百钱百鸡问题
# 公鸡5元一只，母鸡3元一只，小鸡1元三只，用100块钱买一百只鸡，问公鸡、母鸡、小鸡各有多少只？

# # 假设公鸡的数量为x，x的取值范围是0到20
# for x in range(0, 21):
#     # 假设母鸡的数量为y，y的取值范围是0到33
#     for y in range(0, 34):
#         z = 100 - x - y
#         if 5 * x + 3 * y + z // 3 == 100 and z % 3 == 0:
#             print(f'公鸡: {x}只, 母鸡: {y}只, 小鸡: {z}只')

# -------------------------------- practice4 --------------------------------
# 斐波那契数列。
# 斐波那契数列的特点是数列的前两个数都是1，从第三个数开始，每个数都是它前面两个数的和，按照这个规律，斐波那契数列的前10个数是：1, 1, 2, 3, 5, 8, 13, 21, 34, 55
# 输出斐波那契数列前20个数

# a, b = 0, 1
# for _ in range(20):
#     a, b = b, a + b
#     print(a)

# -------------------------------- practice5 --------------------------------
# 打印100以内的素数。
# 素数指的是只能被1和自身整除的正整数（不包括1）。

# for num in range(2, 100):
#     # 假设num是素数
#     is_prime = True
#     # 在2到num-1之间找num的因子
#     for factor in range(2, num):
#         # 如果找到了num的因子，num就不是素数
#         if num % factor == 0:
#             is_prime = False
#             break
#     # 如果布尔值为True在num是素数
#     if is_prime:
#         print(num)
